Repository: wolffe/Metro-Mortgage-Calculator
Catalog: languages/wpmm-*.po
Languages: ro_ro

source: Monthly Payment
ro_ro: Plata lunara

source: Down Payment
ro_ro: Avans

source: Loan Amount
ro_ro: Imprumut

source: Interest paid
ro_ro: Dobanda platita

source: Annual Interest Rate
ro_ro: Rata anuala a dobanzii

source: Loan Term
ro_ro: Termen imprumut

source: years
ro_ro: ani

source: months
ro_ro: luni

source: Closing Costs
ro_ro: Costuri inchidere

source: Payment Type
ro_ro: Tip plata

source: Amount Borrowed
ro_ro: Suma imprumutata

source: Home Price
ro_ro: Pret total

source: Metro Mortgage Calculator Options
ro_ro: Optiuni Calculator Ipoteca Metro

source: Plugin Information
ro_ro: Informatii Plugin

source: You are using
ro_ro: Folosesti

source: Official Web Site
ro_ro: Site oficial

source: Plugin Help and Support
ro_ro: Informatii Plugin

source: For more information and updates, visit the
ro_ro: Pentru mai multe informatii, viziteaza

source: official web site
ro_ro: Site oficial

source: How to use
ro_ro: Cum se foloseste

source: Add the <code>[metro-mortgage-calculator]</code> shortcode to any post or page to start using the calculator. The calculator will use the default options.
ro_ro: Adauga codul <code>[metro-mortgage-calculator]</code> in orice articol sau pagina pentru folosi calculatorul. Calculatorul va folosi optiunile implicite.

source: In order to correctly render the currency symbol, make sure you have the correct encoding in your theme header:<br><code>&lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=utf-8&quot; /&gt;</code> or <code>&lt;meta charset=&quot;utf-8&quot;&gt;</code> if you are using HTML5.
ro_ro: Pentru a folosi corect simbolul valutei alese, asigura-te ca ai folosit encoding-ul corect in header-ul temei:<br><code>&lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=utf-8&quot; /&gt;</code> sau <code>&lt;meta charset=&quot;utf-8&quot;&gt;</code> daca folosesti HTML5.

source: Calculator Options
ro_ro: Optiuni Calculator

source: Theme Options
ro_ro: Optiuni Tema

source: Email Options
ro_ro: Optiuni Email

source: Mortgage
ro_ro: Ipoteca

source: Standard Calculator
ro_ro: Calculator standard

source: Interest Rate
ro_ro: Rata dobanzii

source: Loan Term (years)
ro_ro: Termen imprumut (ani)

source: Send results via email (optional)
ro_ro: Trimite rezultatele prin email (optional)

source: Your email
ro_ro: Adresa email

source: Calculate
ro_ro: Calculeaza

source: Advanced Calculator
ro_ro: Calculator avansat

source: Principal &amp; Interest (pi)
ro_ro: Imprumut si dobanda (pi)

source: Interest Only (io)
ro_ro: Dobanda (io)

source: Mortgage Calculator powered by
ro_ro: Calculator Ipoteca realizat de
